def menu():
    print("Выберите число от 1 до 11")
    print("1. Выбрать фирму фотоаппарата")
    print("2. Выбрать объектив")
    print("3. Выбрать фирму объективов")
    print("4. Выбрать жанр или направление съемки")
    print("5. Выбрать место проведения")
    print("6. Выбрать погоду (если на улице!)")
    print("7. Выбрать время съемки (если на улице!)")
    print("8. Выбрать количество света (если в помещении!)")
    print("9. Сбросить характеристики")
    print("10. Вывести список съемок")
    print("11. Завершить программу")



def menuForFirm1():
    print("Выберите фирму")
    print("1. Canon")
    print("2. Nikon")
    print("3. Sony")
    print("4. Panasonic")
    print("5. Fujifilm")
    print("6. Olympus")
    print("7. Leica")
    print("8. Pentax")
    print("9. Samsung")
    print("10. Kodak")
    print("11. Показать другие фирмы")
    print("Выберите число от 1 до 11")


def menuForFirm2():
    print("Выберите фирму")
    print("1. Hasselblad")
    print("2. Phase One")
    print("3. Ricoh")
    print("4. Minolta")
    print("5. Yashica")
    print("6. Mamiya")
    print("7. Contax")
    print("8. Polaroid")
    print("9. Zeiss")
    print("10. GoPro")
    print("11. Показать другие фирмы")
    print("Выберите число от 1 до 11")


def menuForFirm3():
    print("Выберите")
    print("1. DJI")
    print("2. Casio")
    print("3. Lomography")
    print("4. Konica")
    print("5. Voigtländer")
    print("6. Epson")
    print("7. Rollei")
    print("8. Lytro")
    print("9. Sigma")
    print("10. Vivitar")
    print("Выберите число от 1 до 10")


def menuForLenses1():
    print("Выберите объектив")
    print("1. Стандартный объектив (обычно 50мм)")
    print("2. Широкоугольный объектив")
    print("3. Телеобъектив")
    print("4. Макрообъектив")
    print("5. Фиксированный объектив")
    print("6. Зум-объектив")
    print("7. Рыбий глаз (Fisheye) объектив")
    print("8. Тилт-шифт (Lensbaby) объектив")
    print("9. Портретный объектив")
    print("10. Гелиос")
    print("11. Показать другие объективы")
    print("Выберите число от 1 до 11")


def menuForLenses2():
    print("Выберите объектив")
    print("1. Оникс")
    print("2. Панкейк объектив")
    print("3. Superzoom объектив")
    print("4. Телеконвертер")
    print("5. Адаптер объектива")
    print("6. Анаморфный объектив")
    print("7. Перископный объектив")
    print("8. Призменный объектив")
    print("9. Астроснайпер")
    print("10. Вариообъектив")
    print("Выберите число от 1 до 10")


def menuForGenre1():
    print("Выберите жанр или направление съемки")
    print("1. пейзаж")
    print("2. натюрморт")
    print("3. портрет")
    print("4. репортаж,")
    print("5. документальная фотография")
    print("6. жанровая фотография")
    print("7. рекламная фотография")
    print("8. репродукция")
    print("9. фотоохота")
    print("10. макрофотография")
    print("11. Показать другие жанры")
    print("Выберите число от 1 до 11")


def menuForGenre2():
    print("Выберите жанр или направление съемки")
    print("1. панорамная фотография")
    print("2. ночная фотография")
    print("3. свадебная фотография")
    print("4. контент съемка,")
    print("5. аэросъемка")
    print("6. откровенная фотография")
    print("7. творческая съемка")
    print("8. пленочная фотография")
    print("9. семейная съемка")
    print("10. интерьерная съемка")
    print("Выберите число от 1 до 10")


def menuForPlace():
    print("Выберите место проведения")
    print("1. в помещении")
    print("2. на улице")
    print("Выберите число от 1 до 2")

# Если на улице
def menuForWeather():
    print("Выберите погодные условия")
    print("1. солнечно")
    print("2. пасмурно")
    print("3. дождь")
    print("4. снег")
    print("5. туман")
    print("Выберите число 1 или 5")

# Если на улице
def menuForTime():
    print("Выберите время съемки")
    print("1. рассвет (6:00 - 9:00)")
    print("2. утро (9:00 - 12:00)")
    print("3. день (12:00 - 16:00)")
    print("4. вечер (17:00 - 21:00)")
    print("5. ночь (21:00 - 6:00)")
    print("Выберите число 1 или 5")

# Если в помещении
def menuForAmountOfLight():
    print("Выберите тип заведения")
    print("1. яркий свет")
    print("2. нормальное освещение")
    print("3. темно")
    print("Выберите число от 1 до 3")
